# TemporaryGraphicsHandlerService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..TemporaryGraphicsHandlerService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service Id which permits registration of an callback handler for temporary graphics objects managed by [!:Autodesk::Revit::DB::TemporaryGraphicsManager]. To use this service, developers implement a server class that derives from [!:Autodesk::Revit::UI::ITemporaryGraphicsHandler].
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId TemporaryGraphicsHandlerService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TemporaryGraphicsHandlerService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ TemporaryGraphicsHandlerService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace